{"news":[{"datetime":"18 июня, 2025, 18:34","topic":"Город","title":"С площади 1905 года исчезнет парковка. Что появится на ее месте?"},{"datetime":"18 июня, 2025, 18:17","topic":"Происшествия","title":"«Никогда не смеялся над новенькими». Близкие — о смерти экс-начальника отдела полиции в Екатеринбурге"},{"datetime":"18 июня, 2025, 18:15","topic":"Недвижимость","title":"Суровый. Красивый. Мой. Большой гид по недвижимости для влюбленных в Урал"},{"datetime":"18 июня, 2025, 18:00","topic":"Недвижимость","title":"Жилье в центре от 17 527 рублей в месяц — не сказка. Показали, за что просят такие деньги"},{"datetime":"18 июня, 2025, 17:58","topic":"Криминал","title":"Силовики впервые раскрыли мотивы массовых убийств в Екатеринбурге — их совершала банда экс-милиционеров в конце 90-х"},{"datetime":"18 июня, 2025, 17:45","topic":"Культура","title":"«Она отказалась от госпитализации»: коллеги раскрыли, из-за чего умерла баба Шура из «Любовь и голуби»"},{"datetime":"18 июня, 2025, 17:45","topic":"Здоровье","title":"Лучшим медсестрам Москвы подарили автомобили «Москвич» и путевки на стажировку в Китае"},{"datetime":"18 июня, 2025, 17:25","topic":"Недвижимость","title":"Комфорт как стиль жизни. Как выглядит впечатляющий квартал от пунктуального застройщика"},{"datetime":"18 июня, 2025, 17:22","topic":"Недвижимость","title":"В тихом центре Екатеринбурга завершили строительство компаунда"},{"datetime":"18 июня, 2025, 17:11","topic":"Страна и мир","title":"«Стоят пулеметы, вооруженные люди». Уральская красотка рассказала, как выбиралась из-под обстрелов ракет"},{"datetime":"18 июня, 2025, 17:00","topic":"Страна и мир","title":"Не педофилия, а обычай. Российский волонтер в Африке — о женском обрезании, червях в ногах и 9-летних невестах"},{"datetime":"18 июня, 2025, 16:58","topic":"Лето","title":"Всех зальёт! Свердловские синоптики выпустили экстренное предупреждение"},{"datetime":"18 июня, 2025, 16:48","topic":"Происшествия","title":"Сбежал из-за долгов? Кредиторы засудили пропавшего уральского депутата на миллионы рублей"},{"datetime":"18 июня, 2025, 16:24","topic":"Мой дом","title":"«Никто не собирался включать»: жители Асбеста остались без горячей воды"},{"datetime":"18 июня, 2025, 16:00","topic":"Страна и мир","title":"Индийский пророк дал невероятное предсказание для России — такого вы точно не ожидали"},{"datetime":"18 июня, 2025, 15:54","topic":"Криминал","title":"Безработный поселился в авто Гоши Куценко, а потом убил там женщину: что решил суд"},{"datetime":"18 июня, 2025, 15:49","topic":"Авто","title":"Нашли «Азимут». АВТОВАЗ показал новый кроссовер на базе «Весты»"},{"datetime":"18 июня, 2025, 15:33","topic":"Город","title":"Более 20 известных спортсменов примут участие в мероприятиях экономического форума"},{"datetime":"18 июня, 2025, 15:31","topic":"Происшествия","title":"В Свердловской области подросток набил татуировку и подхватил гепатит"},{"datetime":"18 июня, 2025, 15:30","topic":"Образование","title":"Выпускной для одного. Репортаж с последнего звонка в умирающем селе"},{"datetime":"18 июня, 2025, 14:47","topic":"Страна и мир","title":"Орешкин: «Большая семерка» утратила статус центра глобального роста"},{"datetime":"18 июня, 2025, 14:44","topic":"Происшествия","title":"На Урале женщина ушла отмечать День города и пропала. Её ищут пятый день"},{"datetime":"18 июня, 2025, 14:42","topic":"Образование","title":"Больше 600 школьников удалили с ЕГЭ: что они сделали"},{"datetime":"18 июня, 2025, 14:12","topic":"Происшествия","title":"На шахте в Свердловской области произошло ЧП. Двух человек достали из-под земли"},{"datetime":"18 июня, 2025, 14:00","topic":"Образование","title":"Только гении ответят на 10 из 10 — вы знаете всё на свете или ваш кругозор не из лучших?"},{"datetime":"18 июня, 2025, 13:44","topic":"Мой дом","title":"«Стремно смывать в унитаз». Под Екатеринбургом из кранов течет бурая вода с песком: жителям говорят, что все в норме"},{"datetime":"18 июня, 2025, 13:30","topic":"Страна и мир","title":"Видели ракеты из иллюминатора. Россиянка попала под обстрел между Израилем и Ираном и едва не погибла"},{"datetime":"18 июня, 2025, 13:30","topic":"Страна и мир","title":"«У нас будет расти русский Путин»: почему отец из Палестины не отдает детей маме — врачу из России"},{"datetime":"18 июня, 2025, 13:14","topic":"Город","title":"В центре Екатеринбурга появится новый спуск на воду, но только на один день"},{"datetime":"18 июня, 2025, 13:01","topic":"Город","title":"Знаменитые на всю страну фонари-кресты из парка Маяковского перестали быть похоронными"},{"datetime":"18 июня, 2025, 13:01","topic":"Недвижимость","title":"Легендарный район-победитель. Каково жить на севере Екатеринбурга"},{"datetime":"18 июня, 2025, 13:00","topic":"Здоровье","title":"«Рана полгода не заживала, а тут — за две недели». Как российские ученые создали «живую кожу»: ею лечат ожоги и язвы"},{"datetime":"18 июня, 2025, 12:37","topic":"Культура","title":"Умерла Наталья Тенякова, известная по роли бабы Шуры из «Любовь и голуби»"},{"datetime":"18 июня, 2025, 12:31","topic":"Происшествия","title":"В Свердловской области загадочно исчез председатель думы. Его ищут уже полтора месяца"},{"datetime":"18 июня, 2025, 11:51","topic":"Происшествия","title":"«Я тебе башку снесу». Екатеринбуржец угрожал девушке расправой за просьбу не мочиться на арт-объект"},{"datetime":"18 июня, 2025, 11:28","topic":"Город","title":"По Уралу «проедет» индустриальная выставка"},{"datetime":"18 июня, 2025, 11:19","topic":"Развлечения","title":"«Я просто живу свою жизнь». Уральский блогер ответил на критику за езду с непристегнутым ребенком"},{"datetime":"18 июня, 2025, 11:03","topic":"Недвижимость","title":"Здравствуй, ВИЗ нового поколения. Что происходит на улице Викулова"},{"datetime":"18 июня, 2025, 11:00","topic":"Политика","title":"Китай направил свои самолеты в Иран, а США дали Тегерану сутки для капитуляции: как обостряется конфликт"},{"datetime":"18 июня, 2025, 11:00","topic":"Город","title":"Гости и участники экономического форума в Петербурге смогут воспользоваться умным помощником"}]}