{"news":[{"datetime":"20 июня, 2025, 19:03","topic":"Спорт","title":"«Осужден за контрабанду наркотиков»: чемпиона России в составе «Спартака» экстрадировали в Нидерланды"},{"datetime":"20 июня, 2025, 19:00","topic":"Страна и мир","title":"Чемоданное настроение: спросили у россиян в разных аэропортах, куда они летят и сколько потратят"},{"datetime":"20 июня, 2025, 18:28","topic":"Происшествия","title":"На Сортировке силовики ворвались в спортивный клуб и поставили всех к стенке: видео"},{"datetime":"20 июня, 2025, 18:04","topic":"Криминал","title":"Спецназ задержал подозреваемых в покушении на убийство главы свердловского Минтранса: видео"},{"datetime":"20 июня, 2025, 17:46","topic":"Здоровье","title":"Столичную программу «Стану мамой» могут запустить в регионах"},{"datetime":"20 июня, 2025, 17:30","topic":"Развлечения","title":"«Чем больше народу, тем выше цены». Турист показал обстановку на пляжах Адлера: фото"},{"datetime":"20 июня, 2025, 17:22","topic":"Происшествия","title":"«Запинывали толпой». В Екатеринбурге южане устроили массовую драку у «Баку Плаза» — видео"},{"datetime":"20 июня, 2025, 17:00","topic":"Страна и мир","title":"Столетие под стеклом, а теперь — реставрация. История и архивные фото Мавзолея Ленина: как он стал таким"},{"datetime":"20 июня, 2025, 16:54","topic":"Дороги и транспорт","title":"В Екатеринбурге перестали брать деньги за платную парковку. Но с одним условием"},{"datetime":"20 июня, 2025, 16:41","topic":"Происшествия","title":"Кроссовер вышел на обгон. Стало известно, кто погиб в аварии на трассе М-5 «Урал»"},{"datetime":"20 июня, 2025, 16:26","topic":"Город","title":"В Екатеринбурге строительная техника приехала в скандальный сквер, где мэрия запретила застройку: фото"},{"datetime":"20 июня, 2025, 16:00","topic":"Развлечения","title":"Тест на синдром самозванца: вы правда успешны или всё себе придумали?"},{"datetime":"20 июня, 2025, 15:52","topic":"Дороги и транспорт","title":"В центре Екатеринбурга перекроют движение трамваев. Как поедет транспорт?"},{"datetime":"20 июня, 2025, 15:50","topic":"Без темы","title":"Путин поднял вопросы о зарплатах россияне, сложностях бизнеса и реформировании оборонки — онлайн-трансляция главных заявлений с ПМЭФ"},{"datetime":"20 июня, 2025, 15:32","topic":"Лето","title":"В выходные в Свердловскую область придут проливные дожди и грозы. Штормовое предупреждение"},{"datetime":"20 июня, 2025, 15:30","topic":"Экономика","title":"Глава «Сбера» назвал справедливым курс выше 100 рублей за доллар — что это значит и ждать ли повышения"},{"datetime":"20 июня, 2025, 15:21","topic":"Город","title":"В Екатеринбурге застройщик превратил заброшенный старинный особняк в уникальный детсад: фото"},{"datetime":"20 июня, 2025, 15:18","topic":"Политика","title":"На границу РФ приедут корейские военные, а Трамп стал избегать общения с Зеленским: главное об СВО за неделю"},{"datetime":"20 июня, 2025, 15:00","topic":"Город","title":"На форуме в Санкт-Петербурге обсудили возможность проведения Всемирных хоровых игр в России"},{"datetime":"20 июня, 2025, 15:00","topic":"Культура","title":"«Пальцы короткие, иди на баян». Как певец Женя Трофимов из «Комнаты культуры» шел к славе"},{"datetime":"20 июня, 2025, 14:53","topic":"Культура","title":"В центре Екатеринбурга толпа искупалась в море из пены. Что это было?"},{"datetime":"20 июня, 2025, 14:50","topic":"Город","title":"Владимир Путин выступит на пленарном заседании экономического форума"},{"datetime":"20 июня, 2025, 14:33","topic":"Дороги и транспорт","title":"В Екатеринбурге сменят номера два автобусных маршрута, идущие через центр"},{"datetime":"20 июня, 2025, 14:13","topic":"Криминал","title":"Екатеринбуржца положили лицом в землю за взятку сотруднику ФСБ. Жесткое видео задержания"},{"datetime":"20 июня, 2025, 14:01","topic":"Происшествия","title":"На трассе М-5 «Урал» случилось смертельное ДТП — видео"},{"datetime":"20 июня, 2025, 13:00","topic":"Здоровье","title":"Часто путают с переутомлением или простудой. 8 признаков «молчаливого» инфаркта и советы, как защититься"},{"datetime":"20 июня, 2025, 12:59","topic":"Экономика","title":"Миллионы россиян ждет повышение зарплаты: Минтруд анонсировал изменения в 2026 году"},{"datetime":"20 июня, 2025, 12:57","topic":"Дороги и транспорт","title":"В Екатеринбурге массово начнут закрывать улицы. Показываем их на карте"},{"datetime":"20 июня, 2025, 12:48","topic":"Страна и мир","title":"Как выйти на пенсию раньше положенного срока — все законные способы"},{"datetime":"20 июня, 2025, 12:37","topic":"Страна и мир","title":"«Наконец-то ты дома, брат». В Екатеринбурге похоронили воина-афганца, погибшего на СВО еще в 2022 году"},{"datetime":"20 июня, 2025, 12:30","topic":"Город","title":"Уральцы выиграли престижный международный турнир по баскетболу в Сочи. Они не только спортсмены"},{"datetime":"20 июня, 2025, 12:11","topic":"Недвижимость","title":"В Екатеринбурге выставили на продажу один из самых красивых деревянных домов города"},{"datetime":"20 июня, 2025, 12:00","topic":"Лето","title":"Век ягод не видать: как собирать и защищать клубнику, чтобы не остаться без урожая"},{"datetime":"20 июня, 2025, 11:51","topic":"Происшествия","title":"«Ворвались в здание, вынесли всё». В Екатеринбурге ограбили магазин с дорогущими дронами"},{"datetime":"20 июня, 2025, 11:07","topic":"Криминал","title":"Бывший вице-мэр Екатеринбурга, сидевший за заказные убийства, вышел на свободу. А что с его женой?"},{"datetime":"20 июня, 2025, 11:00","topic":"Криминал","title":"«Ты связана с террористами!» Школьница продала восемь швейцарских часов отца и перевела миллионы мошенникам"},{"datetime":"20 июня, 2025, 10:30","topic":"Образование","title":"Куда легче всего поступить в Екатеринбурге? Список направлений в вузах с низким конкурсом"},{"datetime":"20 июня, 2025, 10:20","topic":"Мой дом","title":"«Люди просто перестанут платить». Екатеринбуржцы пришли в бешенство от новых цен на коммуналку"},{"datetime":"20 июня, 2025, 10:00","topic":"Город","title":"Один из лидеров российского рынка аккумуляторных газонокосилок отмечает юбилей"},{"datetime":"20 июня, 2025, 10:00","topic":"Недвижимость","title":"Хотят хоть сколько-нибудь сэкономить. На что идут люди ради скидок"}]}